[
  "Killed a fellow villager and buried the body beneath the old well.",
  "Poisoned a minor noble for a rival and fears exposure.",
  "Helped smuggle forbidden relics through the temple district.",
  "Harbors a demon in their dreams that whispers royal secrets.",
  "Sold out a resistance cell to the city guard for coin.",
  "Burned a shrine to a forgotten god to please another patron.",
  "Stole a sacred artifact from a ruined temple and hides it nearby.",
  "Knows the true heir to the throne lives in a local village.",
  "Knows the local baron is replaced by an illusion or body double.",
  "Knows the village well is slowly turning people into thralls.",
  "Has a cursed weapon they cannot discard without killing someone.",
  "Has been bribed to mislead adventurers into an ambush.",
  "Has a secret pact with bandits attacking local caravans.",
  "Has hidden plague symptoms with glamers bought from a hedge witch.",
  "Has sheltered a dangerous fugitive wanted by three kingdoms.",
  "Has quietly switched infants of two noble houses.",
  "Has memorized a banned spellbook page-by-page.",
  "Has buried a dragon egg and checks on it in secret.",
  "Has signed their soul away to an archdevil for petty revenge.",
  "Has sabotaged the village defenses to hasten a monster attack.",
  "Wants to awaken an old god sleeping beneath the town.",
  "Wants revenge on a party patron and will betray them at the right time.",
  "Wants to seize control of the local thieves’ guild.",
  "Wants the players to fail so their patron’s prophecy comes true.",
  "Wants to marry into a noble line they are secretly blackmailing.",
  "Wants to unleash a bound demon to “cleanse” the corrupt city.",
  "Wants to recover a relic they once sold that is now destabilizing reality.",
  "Knows the local temple hoards counterfeit relics for profit.",
  "Knows the duke’s war is based on forged documents.",
  "Knows a beloved hero is actually a war criminal in hiding.",
  "Helped summon a minor demon that never left.",
  "Helped falsify tax ledgers to push a village into debt bondage.",
  "Helped kidnap travelers for a hag’s gruesome bargains.",
  "Helped cover up a massacre blamed on monsters.",
  "Helped create forged maps that lead treasure hunters to their doom.",
  "Hides that they can hear the whispers of the dead clearly.",
  "Hides lycanthropy and chains themself up on false “pilgrimages.”",
  "Hides a forbidden romance with an enemy officer.",
  "Hides that they are an escaped experimental subject from a wizard.",
  "Hides the fact they killed their adventuring party for the loot.",
  "Hides an entrance to an Underdark outpost beneath their home.",
  "Hides a sending stone used by a villainous cult.",
  "Hides that the local orphanage is a front for human trafficking.",
  "Hides that their “children” are simulacra or homunculi.",
  "Hides a monstrous form beneath exquisite illusions.",
  "Hides that their bloodline can open an ancient vault.",
  "Hides the location of a slumbering lich’s phylactery.",
  "Hides a halo or horns under scarf and hood.",
  "Knows when the next demon incursion will occur but fears blame.",
  "Knows the king is under a charm that will end in slaughter.",
  "Knows the road the party plans to take is mined with glyphs.",
  "Knows the tavern’s ale is brewed with corpses from plague pits.",
  "Has been feeding prisoners to something in the cellar.",
  "Has forged orders that will start a civil war.",
  "Has secretly sworn fealty to a rival god.",
  "Has replaced several villagers with perfect illusions.",
  "Has the only key to a chained elder evil’s lock.",
  "Has been stealing holy water and watering it down.",
  "Has a stash of mind-control potions ready for a festival.",
  "Has pledged their firstborn to a fae queen already watching.",
  "Wants to steal a dragon’s hoard using the party as cover.",
  "Wants to frame the players for a crime they committed.",
  "Wants to trade their cursed life for another’s via ritual.",
  "Wants to turn the town over to undead rule peacefully.",
  "Wants to resurrect a tyrant king using forbidden rites.",
  "Knows the exact location of a lost divine avatar.",
  "Knows the party’s true names and how to unmake them.",
  "Knows the prophecy everyone quotes is deliberately miscopied.",
  "Knows where an artifact is that erases memories of anyone touching it.",
  "Helped assassinate a prince and disguised it as a hunting mishap.",
  "Helped build the dungeon the party is about to explore.",
  "Helped an aberration nest beneath the sewers.",
  "Helped craft a fake magical sword worshiped as a symbol.",
  "Helped a cult seed monsters inside the city walls.",
  "Fears they are slowly turning into a monster and has proof.",
  "Rigged a contest the players care about for a sinister patron.",
  "Secretly shelters a mind flayer tadpole hoping to study it.",
  "Manipulates weather using a stolen wand for petty power.",
  "Maintains a secret ledger of every bribe in the city.",
  "Breeds monstrous animals for illegal blood sport.",
  "Runs a secret sending network for criminals and cults.",
  "Poisons the town’s incense with enthralling herbs.",
  "Controls a haunted doll that spies for them.",
  "Forged letters that turned two allied houses into enemies.",
  "Traded a village child to a hag for youth.",
  "Built a hidden shrine where sacrifices have resumed.",
  "Smuggles relics that hold trapped souls.",
  "Siphons power from a holy font to a demon idol.",
  "Captured a celestial and hides it in a cellar cage.",
  "Operates as a double agent for two cults at once.",
  "Studies a fragment of an elder brain in their basement.",
  "Guides travelers into cursed ruins to feed a ghost.",
  "Maintains a fake miracle to keep townsfolk obedient.",
  "Plans to burn the docks under cover of an orc raid.",
  "Plans to sell the town map to invading forces.",
  "Plans to open a sealed gate on the next eclipse.",
  "Plans to bind a party member’s soul in a gemstone.",
  "Knows a party member’s darkest secret and is leveraging it.",
  "Knows how to permanently sever someone from their deity.",
  "Has quietly murdered three people with subtle magic."
]
