[
  "Help me find my missing child who followed fireflies into the old barrow last night.",
  "Escort my caravan through the bandit-infested pass before the next full moon.",
  "Retrieve my stolen heirloom sword from the thieves who lurk in the sewers.",
  "Guard our village during the harvest festival; something has been stalking the fields.",
  "Investigate the cursed dreams afflicting everyone who sleeps inside the inn.",
  "Hunt down the wolf that walks like a man and has taken three villagers.",
  "Track the hooded stranger who paid in bloodstained coins and vanished at dawn.",
  "Clear the abandoned mine of monsters so we can reopen it safely.",
  "Protect me while I perform a dangerous ritual to cleanse the haunted well.",
  "Find who is poisoning the temple’s holy water before the next ceremony.",
  "Deliver this sealed letter to the city without opening it or being seen.",
  "Recover my brother’s body from the battlefield before scavengers or necromancers do.",
  "Escort a diplomat to peace talks that enemies want to sabotage.",
  "Break the curse on our family before it claims the last surviving child.",
  "Stop the grave robber who steals only from those buried with silver masks.",
  "Investigate why the forest spirits refuse our offerings and attack our hunters.",
  "Retrieve a lost spellbook from ruins now crawling with undead.",
  "Protect our village from tax collectors backed by mercenary thugs.",
  "Find the source of strange lights over the lake each moonrise.",
  "Rescue captives taken by goblins into caves that shift their tunnels nightly.",
  "Smuggle these refugees over the border past the tyrant’s patrols.",
  "Drive a malicious fey courtier away from our crops and children.",
  "Recover a wagon of plague medicine stolen by desperate bandits.",
  "Find proof that our mayor serves a demon before he becomes untouchable.",
  "Escort a cursed relic to a distant temple where it can be unmade.",
  "Rescue my lover from an arranged marriage to a cruel warlord.",
  "Investigate a traveling circus where people enter but never truly leave.",
  "Retrieve the bell from a sunken chapel that can banish the fog.",
  "Stop the cult that marks homes with invisible sigils at midnight.",
  "Bring back the missing shepherds from hills where music plays with no source.",
  "Purify a ruined shrine so our god will hear us again.",
  "Hunt the invisible beast that leaves only claw marks and frozen corpses.",
  "Steal a ledger from the thieves’ guild to expose corrupt nobles.",
  "Recover a talking skull that knows who will start the coming war.",
  "Escort a scholar into forbidden ruins that rewrite themselves each dusk.",
  "Stop raiders riding undead horses who never dismount or speak.",
  "Retrieve an egg from a monster’s nest before rival mercenaries take it.",
  "Guard a wedding between rival clans from sabotage and bloodshed.",
  "Investigate why no one who sails to the island lighthouse returns.",
  "Capture the outlaw minstrel whose songs incite riots and sudden storms.",
  "Escort a relic across desert sands haunted by vengeful djinn.",
  "Help me steal back my soul from the witch who bottled it.",
  "Track who is impersonating me in crimes across three towns.",
  "Map a newly revealed dungeon before others plunder its secrets.",
  "Stop smugglers bringing cursed idols through the docks at night.",
  "Find the missing bellringer; without him, the dead will not rest.",
  "Escort a child prophet that everyone wants to own or silence.",
  "Investigate a monastery where all the monks now speak in unison.",
  "Retrieve a banner from an old battlefield to calm a restless legion.",
  "Stop the creeping black vines that grow only from blood-soaked soil.",
  "Guard a magical trial in which I must face my own sins.",
  "Break into a wizard’s tower to rescue an apprentice left behind.",
  "Recover stolen dragon tithes before the dragon arrives for collection.",
  "Help me track my memories stolen by a masked sorcerer.",
  "Stop the ghost ship that sails upriver and takes passengers.",
  "Retrieve a crown lost in the crypts that rejects unworthy hands.",
  "Escort pilgrims through a canyon ruled by territorial harpies.",
  "Capture a rogue construct that believes it is a living god.",
  "Investigate livestock born with extra eyes and human-like teeth.",
  "Deliver a message into a city under strict magical silence.",
  "Find who is rewriting holy texts in the temple’s locked archives.",
  "Disrupt a gladiatorial ring where combatants never bleed.",
  "Guard a sacred tree that suddenly began whispering names of the doomed.",
  "Retrieve a gemstone fallen from the sky that warps time nearby.",
  "Escort a bound demon to its prison before its chains fail.",
  "Stop masked figures who dance in the square and lure children away.",
  "Recover illegally hunted unicorn horns before they are powdered for spells.",
  "Help me expose a healer who secretly causes the illnesses they cure.",
  "Investigate a clocktower that chimed thirteen and has not stopped since.",
  "Escort an ancient giant home before hunters and mages dissect him.",
  "Steal a cursed painting that traps viewers in its landscape.",
  "Protect a newborn dragon from knights sworn to slay it.",
  "Help me find who replaced my reflection with someone else’s.",
  "Stop a cult using music to command people in their sleep.",
  "Retrieve a relic from a city that only appears at twilight.",
  "Escort a shipment of holy water that freezes demons into glass.",
  "Help me uncover which guard captain is selling us to slavers.",
  "Investigate why shadows in this town move without their owners.",
  "Find a lost library beneath the sands before rival explorers do.",
  "Protect a mage during an eclipse when their power turns inward.",
  "Stop a noble from opening a gate to impress a dark patron.",
  "Retrieve a stolen grimoire before it finishes rewriting itself.",
  "Help pacify a dragon demanding trials instead of tribute.",
  "Investigate villagers who now speak with the same borrowed voice.",
  "Recover a sacred mask needed to keep a volcano asleep.",
  "Prevent assassins from killing a diplomat at a masquerade ball.",
  "Escort a caravan of golems that have begun whispering.",
  "Help free miners trapped behind a sentient cave-in.",
  "Investigate a plague that only affects those who have lied.",
  "Recover a horn whose sound compels armies to march.",
  "Escort a lich who claims to seek redemption to an altar.",
  "Stop a forest from marching toward the city each night.",
  "Retrieve a blade that will not let its wielder sleep.",
  "Help me confirm whether my dead spouse truly walks again.",
  "Protect a festival where illusions have started becoming real.",
  "Recover a contract that binds an entire town to hell.",
  "Escort a royal bastard to safety before factions find them.",
  "Investigate a temple whose god has started answering in screams.",
  "Stop an order of paladins from executing an innocent monster.",
  "Recover a crate that fell from a flying castle into the woods.",
  "Escort a song to its destination; it vanishes if written down.",
  "Help me track my shadow, which has run away with secrets."
]
